simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/*
 * ESP Esclavo — Geofono node
 *
 * Lee muestras del PSoC via UART (raw) y las envía al maestro via ESP-NOW.
 *
 * Configurar hardware en platformio.ini:
 *   NODE_ID, pines UART al PSoC, pines SYNC, marcadores de osciloscopio
 *   y MAC del maestro.
 *
 * Estados:
 *   WAIT_ARM  → espera CMD_ARM del maestro
 *   ARMED     → envia CMD_ARM_ACK, espera PRESTART
 *   HOT_WAIT  → PRESTART recibido; no hace nada salvo esperar START/consulta
 *   SAMPLING  → lee PSoC y envía batches
 *   STOPPED   → vuelve a WAIT_ARM al recibir CMD_STOP
 */

#include <Arduino.h>
#include <esp_wifi.h>
#include "psoc_uart.h"
#include "espnow_transport.h"
#include "sync_protocol.h"
#include "debug_log.h"
#include "../../scope_measurement.h"

/* ── Configuración ────────────────────────────────────────────────────────── */
#ifndef NODE_ID
  #define NODE_ID 1
#endif
#ifndef SAMPLE_PULSE_PIN
  #define SAMPLE_PULSE_PIN -1   /* Deshabilitado: no conmutar GPIO/LED durante muestreo. */
#endif
#ifndef SAMPLE_PULSE_IDLE
  #if defined(ESP8266)
    #define SAMPLE_PULSE_IDLE HIGH
  #else
    #define SAMPLE_PULSE_IDLE LOW
  #endif
#endif
#ifndef SAMPLE_PULSE_US
  #define SAMPLE_PULSE_US 2
#endif
#ifndef DEBUG_HARDWARE
  #define DEBUG_HARDWARE 0
#endif
#ifndef DEBUG_HW_START_PIN
  #define DEBUG_HW_START_PIN -1
#endif
#ifndef DEBUG_HW_START_IDLE
  #define DEBUG_HW_START_IDLE LOW
#endif
#ifndef DEBUG_HW_START_US
  #define DEBUG_HW_START_US SCOPE_START_PULSE_US
#endif
#ifndef PSOC_CAPTURE_MAX_BATCHES
  #define PSOC_CAPTURE_MAX_BATCHES 360
#endif
/* Logging (humano + máquina) en debug_log.h, gateado por DBG_ENABLE.
 * Estos defines limpian el monitor USB: por defecto queda solo lo accionable
 * para diagnosticar calibracion/captura. */
#ifndef PSOC_DIAG_VERBOSE
  #define PSOC_DIAG_VERBOSE 0
#endif
#ifndef PSOC_CAL_LOG_POINTS
  #define PSOC_CAL_LOG_POINTS 1
#endif
#ifndef PSOC_CAL_LOG_CLAMPED_POINTS
  #define PSOC_CAL_LOG_CLAMPED_POINTS 0
#endif
#ifndef PSOC_CAL_LOG_PROGRESS
  #define PSOC_CAL_LOG_PROGRESS 0
#endif
#ifndef SLAVE_LOG_HELLO_TX
  #define SLAVE_LOG_HELLO_TX 0
#endif
#ifndef SLAVE_LOG_STATUS_PERIODIC
  #define SLAVE_LOG_STATUS_PERIODIC 0
#endif
#ifndef SLAVE_LOG_VIEW_UART
  #define SLAVE_LOG_VIEW_UART 0
#endif
#ifndef SLAVE_USB_CMD_ENABLE
  #define SLAVE_USB_CMD_ENABLE 1
#endif
#ifndef SLAVE_LAB_TOOLS_ENABLE
  #define SLAVE_LAB_TOOLS_ENABLE 0
#endif
#ifndef PSOC_AUTO_CAL_ON_READY
  #define PSOC_AUTO_CAL_ON_READY 1
#endif
#ifndef PSOC_AUTO_CAL_DELAY_MS
  #define PSOC_AUTO_CAL_DELAY_MS 500u
#endif
#ifndef PSOC_AUTO_CAL_RETRY_MS
  #define PSOC_AUTO_CAL_RETRY_MS 3000u
#endif
#ifndef WIFI_TX_POWER_QDBM
  #define WIFI_TX_POWER_QDBM 78
#endif

/* MAC del ESP maestro. El valor real debe venir de platformio.ini. */
#ifndef MASTER_MAC0
  #define MASTER_MAC0 0xFF
#endif
#ifndef MASTER_MAC1
  #define MASTER_MAC1 0xFF
#endif
#ifndef MASTER_MAC2
  #define MASTER_MAC2 0xFF
#endif
#ifndef MASTER_MAC3
  #define MASTER_MAC3 0xFF
#endif
#ifndef MASTER_MAC4
  #define MASTER_MAC4 0xFF
#endif
#ifndef MASTER_MAC5
  #define MASTER_MAC5 0xFF
#endif
static const uint8_t MASTER_MAC_DEFAULT[6] = {
    MASTER_MAC0, MASTER_MAC1, MASTER_MAC2,
    MASTER_MAC3, MASTER_MAC4, MASTER_MAC5
};
static uint8_t g_masterTxMac[6] = {
    MASTER_MAC0, MASTER_MAC1, MASTER_MAC2,
    MASTER_MAC3, MASTER_MAC4, MASTER_MAC5
};

/* Pines GPIO hardware sync. platformio.ini es la fuente de verdad; estos
 * defaults solo evitan romper builds viejos que no definan las macros. */
#ifndef SYNC_IN_PIN
  #if defined(ESP8266)
    #define SYNC_IN_PIN 5
  #else
    #define SYNC_IN_PIN 26
  #endif
#endif
#ifndef SYNC_TO_PSOC_PIN
  #if defined(ESP8266)
    #define SYNC_TO_PSOC_PIN 16
  #else
    #define SYNC_TO_PSOC_PIN 27
  #endif
#endif

/* ── Estado ──────────────────────────────────────────────────────────────── */
enum SlaveState { WAIT_ARM, ARMED, HOT_WAIT, SAMPLING, STOPPED };
static volatile SlaveState g_state       = WAIT_ARM;
static bool                g_psocConnected = false;  /* resultado de probe() en setup */
static volatile uint64_t   g_t_start_us  = 0;
static volatile bool       g_debug_mode  = false;
static          uint32_t   g_debug_count = 0;
static volatile uint32_t   g_debug_last_us = 0;
/* g_debugHwActive / g_debugHwFallUs viven en scope_pulse.h */
static          uint8_t    g_pga_code    = 0;
static          uint8_t    g_pgavdac     = 0;
static          uint8_t    g_vdac_byte   = 128;
static volatile bool       g_cfg_waiting = false;
static          uint8_t    g_cfg_sub_cmd = 0;
static          uint8_t    g_cfg_param   = 0;
static          uint32_t   g_cfg_start_ms = 0;
static          uint32_t   g_cfg_timeout_ms = 0;
static          uint32_t   g_cal_progress_ack_ms = 0; /* ultimo "calibrando..." (ok=2) enviado al maestro */
static          bool       g_auto_cal_requested = false;
static          uint32_t   g_auto_cal_due_ms = 0;

/* ── LED de identificación (CMD_BLINK_LED) ──────────────────────────────────
 * El LED de identificación es el del PSoC (el ESP no tiene un LED útil en el
 * pin 2). El esclavo solo reenvía el comando por UART con psoc.blinkLed(); el
 * PSoC titila su LED de forma NO bloqueante usando su Timer. */

/* ── Store-and-forward ───────────────────────────────────────────────────── */
static uint16_t    g_rec_n_batches = 0;          /* 0 = modo streaming clásico */
static SampleBytes *g_store_buf    = nullptr;    /* n_batches × 30 SampleBytes */
static uint32_t   *g_store_ts_us   = nullptr;    /* timestamp relativo por batch */
static uint16_t    g_store_fill    = 0;

/* ── Capturas store-then-dump: VER y START normal ────────────────────────── */
static volatile uint16_t g_view_remaining    = 0; /* legado live deshabilitado */
static volatile bool     g_view_store_active = false;
static volatile bool     g_start_store_active = false;

#define PSOC_CFG_ACK_TIMEOUT_MS 750u
#define PSOC_CAL_ACK_TIMEOUT_MS 450000u
#define PSOC_ADC_SNAPSHOT_ACK_TIMEOUT_MS 5000u
#define PSOC_CAL_PROGRESS_ACK_PERIOD_MS 3000u /* "sigue calibrando" (ok=2) hacia el maestro */
#define PSOC_CFG_READY_STALE_MS 5000u
#ifndef PSOC_START_FALLBACK_EXTRA_MS
  #ifdef PSOC_VIEW_START_FALLBACK_EXTRA_MS
    #define PSOC_START_FALLBACK_EXTRA_MS PSOC_VIEW_START_FALLBACK_EXTRA_MS
  #else
    #define PSOC_START_FALLBACK_EXTRA_MS 350u
  #endif
#endif

static uint32_t g_sampling_start_ms = 0;
static uint32_t g_sampling_start_psoc_bytes = 0;
static uint32_t g_sampling_start_batches_ok = 0;
static bool     g_start_fallback_sent = false;

static volatile uint32_t g_psoc_rx_edges = 0;
static volatile uint8_t  g_psoc_rx_last_level = 0;

#ifndef PSOC_RX_SCAN_ENABLE
  #define PSOC_RX_SCAN_ENABLE 0
#endif

#if PSOC_RX_SCAN_ENABLE
struct GpioScanSlot {
    uint8_t pin;
    volatile uint32_t edges;
    volatile uint8_t level;
};

