simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void requestBlinkFromUsb()
{
    /* Titilar el LED del PSoC (mismo camino que CMD_BLINK_LED de la web). */
    psoc.blinkLed();
    SLAVE_LOG_PRINTF("[USB] blink -> PSoC CMD 0x%02X\n", PSOC_CMD_BLINK_LED);
    LOGM("USB_CMD", "cmd=blink,ok=1,sub=0x%02X", PSOC_CMD_BLINK_LED);
}

static void requestProbeFromUsb()
{
    g_psocConnected = psoc.probe(400);
    SLAVE_LOG_PRINTF("[USB] probe psoc=%u\n", (unsigned)g_psocConnected);
    logPsocUartDiag("USB_PROBE");
    LOGM("USB_CMD", "cmd=probe,ok=%u", (unsigned)g_psocConnected);
}

static void requestStatusFromUsb()
{
    psoc.requestStatus();
    delay(40);
    psoc.poll();
    servicePsocConfigAck();
    logPsocUartDiag("USB_STATUS");
    LOGM("USB_CMD", "cmd=status,ok=1");
}

static void requestStreamFromUsb(uint16_t mode)
{
    const uint8_t streamMode = (mode != 0u) ? 1u : 0u;
    psoc.selectStream(streamMode);
    SLAVE_LOG_PRINTF("[USB] stream %u -> PSoC CMD 0x%02X\n",
                     (unsigned)streamMode, PSOC_CMD_SELECT_STREAM);
    LOGM("USB_CMD", "cmd=stream,mode=%u", (unsigned)streamMode);
}

static void requestDebugPsocFromUsb(uint16_t enable)
{
    psoc.debugRamp(enable != 0u);
    SLAVE_LOG_PRINTF("[USB] debugpsoc %u -> PSoC CMD 0x%02X\n",
                     (unsigned)(enable != 0u), PSOC_CMD_DEBUG);
    LOGM("USB_CMD", "cmd=debugpsoc,en=%u", (unsigned)(enable != 0u));
}

static void requestPrestartFromUsb(uint16_t n)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[USB] pre ignored: busy state=%d fill=%u/%u\n",
                         (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        return;
    }
    enterHotWait(n);
    g_view_store_active = false;
    g_start_store_active = false;
    SLAVE_LOG_PRINTF("[USB] pre n=%u state=%d ready=%u\n",
                     (unsigned)g_rec_n_batches, (int)g_state,
                     (unsigned)storeReadyForHotWait());
    LOGM("USB_CMD", "cmd=pre,n=%u,ready=%u",
         (unsigned)g_rec_n_batches, (unsigned)storeReadyForHotWait());
}

static void requestUsbStartFromHotWait()
{
    if (g_state != HOT_WAIT || !storeReadyForHotWait()) {
        SLAVE_LOG_PRINTF("[USB] sync ignored state=%d ready=%u\n",
                         (int)g_state, (unsigned)storeReadyForHotWait());
        return;
    }
    uint32_t nowUs = (uint32_t)micros();
    int syncBefore = digitalRead(SYNC_TO_PSOC_PIN);
    digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
    int syncAfter = digitalRead(SYNC_TO_PSOC_PIN);
    g_t_start_us = (uint64_t)nowUs;
    g_store_fill = 0;
    g_debug_count = 0;
    g_debug_last_us = nowUs;
    g_sampling_start_ms = millis();
    g_sampling_start_psoc_bytes = psoc.bytesRx();
    g_sampling_start_batches_ok = psoc.batchesOK();
    g_view_store_active = false;
    g_start_store_active = (g_rec_n_batches > 0 && g_store_buf != nullptr);
    g_start_fallback_sent = false;
    g_state = SAMPLING;
    SLAVE_LOG_PRINTF("[USB] sync start n=%u sync=%d->%d bytes=%lu\n",
                     (unsigned)g_rec_n_batches, syncBefore, syncAfter,
                     (unsigned long)g_sampling_start_psoc_bytes);
    LOGM("USB_CMD", "cmd=sync,n=%u,syncBefore=%d,syncAfter=%d",
         (unsigned)g_rec_n_batches, syncBefore, syncAfter);
}

static void requestStartNowFromUsb(uint16_t n)
{
    uint32_t nowUs;
    n = clampPsocCaptureBatches(n);
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[USB] startnow ignored: busy state=%d fill=%u/%u\n",
                         (int)g_state, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        return;
    }
    allocStore(n);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_view_store_active = false;
    g_start_store_active = (g_rec_n_batches > 0 && g_store_buf != nullptr);
    g_start_fallback_sent = false;
    g_store_fill = 0;
    nowUs = (uint32_t)micros();
    g_t_start_us = (uint64_t)nowUs;
    g_debug_count = 0;
    g_debug_last_us = nowUs;
    g_sampling_start_ms = millis();
    g_sampling_start_psoc_bytes = psoc.bytesRx();
    g_sampling_start_batches_ok = psoc.batchesOK();
    g_state = SAMPLING;
    psoc.setN(g_rec_n_batches);
    psoc.startNow();
    SLAVE_LOG_PRINTF("[USB] startnow n=%u bytes=%lu store=%u\n",
                     (unsigned)g_rec_n_batches,
                     (unsigned long)g_sampling_start_psoc_bytes,
                     (unsigned)g_start_store_active);
    LOGM("USB_CMD", "cmd=startnow,n=%u,store=%u",
         (unsigned)g_rec_n_batches, (unsigned)g_start_store_active);
}

static void requestCaptureFromUsb(uint16_t n)
{
    requestPrestartFromUsb(n);
    requestUsbStartFromHotWait();
}

static void requestStopFromUsb()
{
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    g_debug_mode = false;
    debugEspSetRamp(false);
    psoc.debugRamp(false);
    g_view_store_active = false;
    g_start_store_active = false;
    g_start_fallback_sent = false;
    g_view_remaining = 0;
    allocStore(0);
    g_state = STOPPED;
    SLAVE_LOG_PRINTLN("[USB] stop");
    LOGM("USB_CMD", "cmd=stop,ok=1");
}

static void requestClearFromUsb()
{
    g_view_store_active = false;
    g_start_store_active = false;
    g_start_fallback_sent = false;
    g_view_remaining = 0;
    allocStore(0);
    if (g_state != SAMPLING && g_state != HOT_WAIT) {
        g_state = STOPPED;
    }
    SLAVE_LOG_PRINTLN("[USB] clear");
    LOGM("USB_CMD", "cmd=clear,ok=1");
}

static bool requestPsocGainFromUsb(uint8_t subCmd, uint8_t param, const char *name)
{
    bool sent = false;
    if (!isGainCode(param)) {
        LOGM("USB_CMD", "cmd=%s,ok=0,reason=bad_gain,value=%u", name, (unsigned)param);
        return false;
    }
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        LOGM("USB_CMD", "cmd=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             name, g_cfg_sub_cmd);
        return false;
    }
    if (ensurePsocReadyForConfig()) {
        if (subCmd == PSOC_CMD_PGA) {
            psoc.setPga(param);
        } else {
            psoc.setPgavdac(param);
        }
        waitForPsocConfigAck(subCmd, param);
        sent = true;
    }
    SLAVE_LOG_PRINTF("[USB] %s %u -> PSoC CMD 0x%02X\n",
                     name, (unsigned)param, subCmd);
    LOGM("USB_CMD", "cmd=%s,ok=%u,sub=0x%02X,value=%u",
         name, (unsigned)sent, subCmd, (unsigned)param);
    return sent;
}

/* "range N" — banco de pruebas: selecciona la config de rango del ADC
 * (1=CF_2V5, 2=CF_0V512, 3=CF_1V024, 4=CF_0V625) sin pasar por el maestro. */
static bool requestAdcConfigFromUsb(uint8_t cfg)
{
    bool sent = false;
    if (!isAdcConfigCode(cfg)) {
        LOGM("USB_CMD", "cmd=range,ok=0,reason=bad_range,value=%u", (unsigned)cfg);
        return false;
    }
    servicePsocConfigAck();
    if (g_cfg_waiting) {
        LOGM("USB_CMD", "cmd=range,ok=0,reason=cfg_busy,pending=0x%02X", g_cfg_sub_cmd);
        return false;
    }
    if (ensurePsocReadyForConfig()) {
        psoc.setAdcConfig(cfg);
        waitForPsocConfigAck(PSOC_CMD_ADC_CONFIG, cfg);
        sent = true;
    }
    SLAVE_LOG_PRINTF("[USB] range %u -> PSoC CMD 0x%02X\n", (unsigned)cfg, PSOC_CMD_ADC_CONFIG);
    LOGM("USB_CMD", "cmd=range,ok=%u,sub=0x%02X,value=%u",
         (unsigned)sent, PSOC_CMD_ADC_CONFIG, (unsigned)cfg);
    return sent;
}

