simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/* ── Callback PSoC — batch recibido ─────────────────────────────────────── */

static void onBatch(const PsocBatch &batch)
{
    if (g_state != SAMPLING) return;
    g_psocConnected = true;

    if (g_view_remaining > 0) {
        g_view_remaining = 0;   /* fail-safe: VIEW live no debe transmitir mientras muestrea */
    }

    /* Routing normal: si g_store_buf está allocado → acumula; si no → en vivo. */
    if (g_store_buf && g_store_fill < g_rec_n_batches) {
        /* Store-and-forward: acumular en RAM, sin RF */
        SampleBytes *dst = &g_store_buf[(size_t)g_store_fill * SPI_BATCH_SAMPLES];
        for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
            const PsocSample &s = batch.samples[i];
            dst[i].raw_lo = (uint8_t)( s.raw_input         & 0xFF);
            dst[i].raw_hi = (uint8_t)((s.raw_input  >> 8)  & 0xFF);
            dst[i].alog0  = (uint8_t)( s.post_analog        & 0xFF);
            dst[i].alog1  = (uint8_t)((s.post_analog >>  8) & 0xFF);
            dst[i].alog2  = (uint8_t)((s.post_analog >> 16) & 0xFF);
            dst[i].digi0  = (uint8_t)( s.post_digital        & 0xFF);
            dst[i].digi1  = (uint8_t)((s.post_digital >>  8) & 0xFF);
            dst[i].digi2  = (uint8_t)((s.post_digital >> 16) & 0xFF);
            dst[i].gain   = s.gain_byte;
            dst[i].flags  = s.sample_flags;
        }
        g_store_ts_us[g_store_fill] = (uint32_t)batch.timestamp_us;
        g_store_fill++;
        if (g_store_fill >= g_rec_n_batches) {
            g_state = STOPPED;
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTF("[SLAVE] FULL -> STOPPED (%u batches)\n", g_store_fill);
            if (g_view_store_active) {
                g_view_store_active = false;
                g_start_store_active = false;
                sendCfgAck(CMD_VIEW, 2);   /* VIEW_DONE: ahora sí puede empezar el dump */
                SLAVE_LOG_PRINTF("[SLAVE] VIEW capture done -> ACK\n");
                LOGM("VIEWDONE", "store=1,n=%u", g_store_fill);
            } else if (g_start_store_active) {
                g_start_store_active = false;
                sendCfgAck(CMD_START, 2);  /* START_DONE: master puede dumpear */
                SLAVE_LOG_PRINTF("[SLAVE] START capture done -> ACK\n");
                LOGM("STARTDONE", "store=1,n=%u", g_store_fill);
            }
        }
    } else if (g_debug_mode) {
        /* Test: transmitir en vivo la rampa (no es señal ADC real, RF no afecta). */
        SampleBytes sb[SPI_BATCH_SAMPLES];
        for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
            const PsocSample &ps = batch.samples[i];
            sb[i].raw_lo = (uint8_t)( ps.raw_input          & 0xFF);
            sb[i].raw_hi = (uint8_t)((ps.raw_input   >>  8) & 0xFF);
            sb[i].alog0  = (uint8_t)( ps.post_analog         & 0xFF);
            sb[i].alog1  = (uint8_t)((ps.post_analog  >>  8) & 0xFF);
            sb[i].alog2  = (uint8_t)((ps.post_analog  >> 16) & 0xFF);
            sb[i].digi0  = (uint8_t)( ps.post_digital         & 0xFF);
            sb[i].digi1  = (uint8_t)((ps.post_digital >>  8) & 0xFF);
            sb[i].digi2  = (uint8_t)((ps.post_digital >> 16) & 0xFF);
            sb[i].gain   = ps.gain_byte;
            sb[i].flags  = ps.sample_flags;
        }
        uint64_t ts = g_t_start_us + (uint64_t)batch.timestamp_us;
        transport.sendStoredBatch(sb, g_store_fill, ts, NODE_ID);
        g_store_fill++;
    }
}

/* ── Setup ───────────────────────────────────────────────────────────────── */

void setup()
{
    dbgLogBegin(DBG_LOG_BAUD);   /* Serial USB del esclavo = canal de log */
    SLAVE_LOG_PRINTF("[SLAVE %d] boot\n", NODE_ID);
    samplePulseBegin();
    debugEspHardwareBegin();
    SLAVE_LOG_PRINTF("[SCOPE] sample pulse pin=%d idle=%d us=%d\n",
                     SAMPLE_PULSE_PIN, SAMPLE_PULSE_IDLE, SAMPLE_PULSE_US);
    SLAVE_LOG_PRINTF("[SCOPE] debugHardware=%d start pin=%d idle=%d us=%d\n",
                     DEBUG_HARDWARE, DEBUG_HW_START_PIN,
                     DEBUG_HW_START_IDLE, DEBUG_HW_START_US);

#if defined(ESP8266)
    /* Modo AP oculto en canal 1: evita el background scanning que hace el
     * ESP8266 en modo STA desconectado (recorre ch1-13 buscando APs y pierde
     * paquetes ESP-NOW del canal 1 a distancia real). */
    WiFi.mode(WIFI_AP);
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    WiFi.setOutputPower(20.5f);
    WiFi.softAP("GeoSlave", "", 1, 1);   /* ssid, pass vacío, canal 1, oculto */
    delay(100);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d (AP-fixed)\n",
                     WiFi.macAddress().c_str(), wifi_get_channel());
#else
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    esp_wifi_set_ps(WIFI_PS_NONE);
    esp_wifi_set_max_tx_power(WIFI_TX_POWER_QDBM);
    WiFi.disconnect();
    delay(100);
    /* Fijar canal 1 explícitamente para coincidir con el AP del maestro.
     * Sin esto, STA desconectado puede quedar en canal 0 (indefinido) y los
     * paquetes ESP-NOW se pierden porque maestro y esclavo están en canales distintos. */
    esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d\n",
                     WiFi.macAddress().c_str(), WiFi.channel());
    SLAVE_LOG_PRINTF("[SLAVE] WiFi ps=off tx=%d qdBm\n", WIFI_TX_POWER_QDBM);
#endif

    /* ESP-NOW */
    if (!transport.begin(g_masterTxMac)) {
        SLAVE_LOG_PRINTLN("[SLAVE] ESP-NOW FAIL - halt");
        while (true) { delay(1000); }
    }
    esp_now_register_recv_cb(onDataRecv);

    /* (El LED de identificación es el del PSoC; el ESP ya no maneja ningún LED.) */

    /* GPIO hardware sync — pull-down para evitar ISR espurias cuando no hay cable */
    pinMode(SYNC_IN_PIN,      INPUT_PULLDOWN);
    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    attachInterrupt(digitalPinToInterrupt(SYNC_IN_PIN), onSyncEdge, CHANGE);

    /* UART → PSoC */
    psoc.begin(onBatch);
    psoc.onDiag(onPsocDiag);
    g_psoc_rx_last_level = (uint8_t)digitalRead(PSOC_UART_RX);
    attachInterrupt(digitalPinToInterrupt(PSOC_UART_RX), onPsocRxEdge, CHANGE);
#if PSOC_RX_SCAN_ENABLE
    beginPsocRxScan();
#endif

    /* Intentar detectar el PSoC una vez. Si no responde, se reintenta cada 2 s
     * en loop() para no bloquear ESP-NOW ni la generación de batches debug. */
    SLAVE_LOG_PRINTF("[SLAVE %d] Buscando PSoC...\n", NODE_ID);
    g_psocConnected = psoc.probe(300);
    if (g_psocConnected) {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC: DETECTADO\n", NODE_ID);
        LOGM("PSOC", "detected=1");
        scheduleAutoCalibration(PSOC_AUTO_CAL_DELAY_MS);
    } else {
        SLAVE_LOG_PRINTF("[SLAVE %d] PSoC sin respuesta — reintentando en loop\n", NODE_ID);
        LOGM("PSOC", "detected=0,retry=loop");
    }

    SLAVE_LOG_PRINTF("[SLAVE %d] listo, esperando ARM\n", NODE_ID);
    LOGM("BOOT", "node=%d,psoc=%d", NODE_ID, (int)g_psocConnected);
}

/* ── Loop ────────────────────────────────────────────────────────────────── */

void loop()
{
    if (g_state != SAMPLING) {
        debugEspHardwareService();
    }

    /* Drenar siempre la UART del PSoC (onBatch ignora si no está SAMPLING). */
    if (g_state == SAMPLING && g_debug_mode) {
        /* debug ESP: generar batch falso a 29412 µs (30 muestras @ 1020 Hz) */
        uint32_t nowUs = (uint32_t)micros();
        if ((uint32_t)(nowUs - g_debug_last_us) >= 29412) {
            g_debug_last_us += 29412;
            PsocBatch fake = {};
            fake.seq         = (uint16_t)(g_debug_count / SPI_BATCH_SAMPLES);
            fake.n_samples   = SPI_BATCH_SAMPLES;
            fake.timestamp_us= (uint64_t)micros() - g_t_start_us;
            for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
                fake.samples[i].post_digital = (int32_t)(g_debug_count & 0xFFFFFF);
                fake.samples[i].gain_byte = g_pga_code;
                fake.samples[i].sample_flags = 0;
                g_debug_count++;
            }
            onBatch(fake);
        }
    } else {
        psoc.poll();
    }
    servicePsocConfigAck();
    serviceUsbCommands();
    serviceAutoCalibration();

    /* (El parpadeo de identificación lo hace ahora el PSoC con su Timer; el ESP
     * solo reenvía CMD_BLINK_LED por UART en onDataRecv.) */

    /* Mientras se llena el store (Ver/Test con n_batches>0), imprimir UART cada 1 s.
     * Esto separa cable/pin (uartBytes=0) de protocolo/baud (bytes sin frames)
     * de "onBatch no incrementa fill" (psoc.poll() no entrega PsocBatch). */
#if SLAVE_LOG_VIEW_UART
    static uint32_t lastViewDiagMs = 0;
    if (g_state == SAMPLING && g_rec_n_batches > 0 &&
        (millis() - lastViewDiagMs) >= 1000) {
        lastViewDiagMs = millis();
        logPsocUartDiag("VIEW_UART");
    }
#endif

    bool storeCaptureActive = g_view_store_active || g_start_store_active;
    if (g_state == SAMPLING && storeCaptureActive && g_rec_n_batches > 0 &&
        g_store_fill == 0 && !g_start_fallback_sent) {
        uint32_t elapsedMs = millis() - g_sampling_start_ms;
        uint32_t fallbackMs = expectedCaptureMs(g_rec_n_batches);
        uint32_t bytesNow = psoc.bytesRx();
        uint32_t batchesNow = psoc.batchesOK();
        if (elapsedMs >= fallbackMs && batchesNow == g_sampling_start_batches_ok) {
            const char *mode = g_view_store_active ? "VIEW" : "START";
            g_start_fallback_sent = true;
            SLAVE_LOG_PRINTF("[SLAVE] %s_SYNC_STALL elapsed=%lu/%lu sync=%d bytes=%lu->%lu bOK=%lu->%lu fill=%u/%u -> START_NOW UART\n",
                             mode,
                             (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                             digitalRead(SYNC_TO_PSOC_PIN),
                             (unsigned long)g_sampling_start_psoc_bytes,
                             (unsigned long)bytesNow,
                             (unsigned long)g_sampling_start_batches_ok,
                              (unsigned long)batchesNow,
                              (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            LOGM("CAPTURE_SYNC_STALL", "mode=%s,ms=%lu/%lu,sync=%d,bytes=%lu->%lu,bOK=%lu->%lu,fill=%u/%u",
                 mode,
                 (unsigned long)elapsedMs, (unsigned long)fallbackMs,
                 digitalRead(SYNC_TO_PSOC_PIN),
                 (unsigned long)g_sampling_start_psoc_bytes,
                 (unsigned long)bytesNow,
                 (unsigned long)g_sampling_start_batches_ok,
                 (unsigned long)batchesNow,
                 (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
            psoc.startNow();
        }
    }

